In [261]:
from tabula import read_pdf
import pandas as pd

In [249]:
page = 'https://www1.nyc.gov/assets/doh/downloads/pdf/imm/covid-19-daily-data-summary-03172020-2.pdf'

In [250]:
df = read_pdf(page, output_format='dataframe', pages='1', stream=True)
df = df[0]
df.columns = ['key', 'value']
df

                 key      value
0          Age Group        NaN
1          -  0 to 4     0 (0%)
2         -  5 to 17    25 (3%)
3        -  18 to 49  457 (50%)
4        -  50 to 64  211 (23%)
5     -  65 and over  230 (25%)
6                Sex        NaN
7          -  Female  378 (41%)
8            -  Male  536 (59%)
9            Borough        NaN
10          -  Bronx        106
11       -  Brooklyn        236
12      -  Manhattan        290
13         -  Queens        248
14  -  Staten Island         42
15        -  Unknown          1
16            Deaths         10

In [259]:
def slice(df, val, num_rows=1, skip_row = True):
    idx = df.index[df['key'] == val]
    if idx.empty:
        return pd.DataFrame(columns = df.columns)
    idx = idx[0]
    if skip_row:
        return df.loc[idx+1:idx+num_rows]
    else:
        return df.loc[idx:idx+num_rows]

slice(df, 'Age Group', 6)

False

              key      value
1       -  0 to 4     0 (0%)
2      -  5 to 17    25 (3%)
3     -  18 to 49  457 (50%)
4     -  50 to 64  211 (23%)
5  -  65 and over  230 (25%)
6             Sex        NaN

In [262]:
slice(df, 'Age 50 and over', 2)

True

Empty DataFrame
Columns: [key, value]
Index: []

In [103]:
slice(df, 'Sex', 3)

           key       value
11   -  Female  1630 (41%)
12     -  Male  2315 (59%)
13  -  Unknown           9

In [104]:
slice(df, 'Borough', 6)

                 key value
15          -  Bronx   496
16       -  Brooklyn  1195
17      -  Manhattan  1038
18         -  Queens  1042
19  -  Staten Island   179
20        -  Unknown     4

In [106]:
slice(df, 'Deaths', skip_row=False)

       key value
21  Deaths    26

In [247]:
import re
# m = re.match('(?P<abs>\d+)([\s|(])?(?P<pct>\d+%)?', '1726 (2%)') #'1726 (2%)')
m = re.match('(?P<abs>\d+)([\s|(]+(?P<pct>\d+)%)?', '123') #'1726 (2%)')
m

In [248]:
m.groupdict()

{'abs': '123', 'pct': None}

In [243]:
m.group('abs')

'1726'

In [244]:
m.group('pct')

'2'